---
type: SlabEdge
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# SlabEdge

`Autodesk.Revit.DB.SlabEdge` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSegment | — | `public override void AddSegment ( Reference targetRef )` |
| Property | Parameter | — | `` |
| Property | SlabEdgeType | — | `public SlabEdgeType SlabEdgeType { get ; set ; }` |